OpenFOAM/WFD_OpenFOAM/cases/batch_20260528_104510_fa7b09/pitch_8p0_baseline_chord/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 288.15;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 288.15;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 288.15;
        value           uniform 288.15;
    }

    sideWalls
    {
        type            zeroGradient;
    }

    propeller
    {
        type            zeroGradient;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
